# แบบฝึกหัด 2

---

จากข้อมูล titanic.csv ให้ทำการวิเคราะห์ข้อมูลเบื้องต้นเกี่ยวกับคอลัมน์ cabin  
โดยแผนภาพด้านล่างนี้เป็นตำแหน่งของ cabin ตามตัวอักษรตัวแรกของรหัส cabin ที่บันทึกในชุดข้อมูล

![titanic-cabin](https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Olympic_%26_Titanic_cutaway_diagram.png/800px-Olympic_%26_Titanic_cutaway_diagram.png)

ให้นิสิตสร้างคอลัมน์เพิ่ม โดยคอลัมน์ที่เพิ่มมานี้ จะเก็บข้อมูลของตัวอักษรตัวแรกที่ปรากฏในคอลัมน์ Cabin เช่น  
- หากในคอลัมน์ Cabin เป็นค่า "C123" ในคอลัมน์ที่สร้างจะบันทึก "C"  
- หากในคอลัมน์ Cabin เป็นค่า "C23 C25 C27" ในคอลัมน์ที่สร้างจะบันทึก "C"
- หากในคอลัมน์ Cabin เป็นค่า "B58 B60 C2" ในคอลัมน์ที่สร้างจะบันทึก "B"
- หากในคอลัมน์ Cabin เป็นค่า "F2" ในคอลัมน์ที่สร้างจะบันทึก "F"
- หากในคอลัมน์ Cabin เป็นค่า NaN ในคอลัมน์ที่สร้างจะบันทึก NaN

จากนั้นให้นิสิตเขียนโค้ดเพื่อตอบคำถามในแต่ละข้อ

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/ThammakornS/ProgStat/main/dataset/titanic.csv")
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

นิสิตแสดงวิธีสร้างคอลัมน์

In [3]:
#your code
#df['cabin_letter'] = df["Cabin"].str.get(0)

df['cabin_letter'] = [c[0] if not pd.isnull(c) else np.NaN for c in df.Cabin]

print(type(df))
df.head(10)

<class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_letter
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,C
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,NaN
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,NaN
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,E
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,NaN
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,NaN
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,NaN

1. ในแต่ละตัวอักษร Cabin มีจำนวนผู้โดยสารกี่คน และมีจำนวน NaN เท่าไหร่

In [4]:
#your code
# print(type(df['cabin_letter']))
df['cabin_letter'].value_counts(dropna=False)

NaN    687
C       59
B       47
D       33
E       32
A       15
F       13
G        4
T        1
Name: cabin_letter, dtype: int64

2. ในแต่ละตัวอักษร Cabin มีจำนวนผู้โดยสารที่รอดและเสียชีวิตอย่างละเท่าไหร่ cabin ใดมีจำนวนผู้เสียชีวิตมากที่สุด

In [5]:
#your code
# df.query('Survived == 1 | Survived == 0').filter(['Survived', 'cabin_letter'], axis=1).value_counts(dropna=True)
# df.filter(['cabin_letter','Survived']).groupby(['Survived']).value_counts(dropna=True)
survie_df = pd.crosstab(df.cabin_letter, df.Survived, margins=False )
survie_df = survie_df.sort_values(by=0,ascending=False)
survie_df

Survived       0   1
cabin_letter
C             24  35
B             12  35
A              8   7
D              8  25
E              8  24
F              5   8
G              2   2
T              1   0

In [6]:
survie_df.index

Index(['C', 'B', 'A', 'D', 'E', 'F', 'G', 'T'], dtype='object', name='cabin_letter')

3. cabin ใดมีค่า ผู้รอดชีวิต/ผู้เสียชีวิต สูงสุด

In [7]:
#your code
survie_df['survie/die'] = survie_df[1]/survie_df[0]
survie_df.sort_values(by='survie/die',ascending=False)

Survived       0   1  survie/die
cabin_letter
D              8  25    3.125000
E              8  24    3.000000
B             12  35    2.916667
F              5   8    1.600000
C             24  35    1.458333
G              2   2    1.000000
A              8   7    0.875000
T              1   0    0.000000

In [8]:
lst_temp = survie_df.index
lst_temp[np.argmax(survie_df["survie/die"])]

'D'

4. cabin ใดมีค่าเฉลี่ยราคาตั๋ว (Fare) สูงสุด

In [11]:
#your code
fare_cabin = df.filter(['Fare','cabin_letter']).groupby(['cabin_letter'])
fare_cabin = fare_cabin.mean().sort_values(by='Fare',ascending=False)
fare_cabin

                    Fare
cabin_letter
B             113.505764
C             100.151341
D              57.244576
E              46.026694
A              39.623887
T              35.500000
F              18.696792
G              13.581250

In [14]:
# print(type(fare_cabin))
fare_cabin.index[np.argmax(fare_cabin["Fare"])]

<class 'pandas.core.frame.DataFrame'>

'B'

5. จงแสดงค่าเฉลี่ยราคาตั๋ว (Fare) ของผู้รอดชีวิต และผู้เสียชีวิต ในแต่ละ cabin หากเปรียบเทียบราคาเฉลี่ยของผู้ที่รอดและเสียชีวิตจะพบว่า

In [27]:
#your code
new_group_fare = df.filter(['cabin_letter', 'Fare', 'Survived']).groupby(['cabin_letter','Survived']).mean()
#new_group_fare = pd.crosstab(df.cabin_letter, df.Survived, values=df.Fare, aggfunc='mean' )
new_group_fare

                             Fare
cabin_letter Survived
A            0          35.496350
             1          44.341071
B            0          57.137500
             1         132.832026
C            0          99.972396
             1         100.274046
D            0          53.770825
             1          58.356176
E            0          43.715625
             1          46.797050
F            0          11.340000
             1          23.294787
G            0          10.462500
             1          16.700000
T            0          35.500000

6. ในแต่ละอักษร cabin มีจำนวนผู้โดยสารแยกตาม Pclass อย่างละกี่คน

In [28]:
#your code
group_cabin_PClass = pd.crosstab(df['cabin_letter'], df["Pclass"])
group_cabin_PClass

Pclass         1  2  3
cabin_letter
A             15  0  0
B             47  0  0
C             59  0  0
D             29  4  0
E             25  4  3
F              0  8  5
G              0  0  4
T              1  0  0